Wassertank_Rohr_gedreht/constant/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel        Smagorinsky;

turbulence      on;

printCoeffs     on;

delta           vanDriest;

     SmagorinskyCoeffs
            {
                delta           vanDriest;
                fieldMaps
                {
                    nuSgs   nuSgs;
                }
            }





vanDriestCoeffs
{
    delta           smooth;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.15;
    }

    Aplus           26;
    Cdelta          0.158;
}



// ************************************************************************* //
