Wassertank_Rohr_gedreht/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.1_engysEdition-1.0                            |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     buoyantPimpleFoam;

startFrom       latestTime;

startTime       0;

//stopAt writeNow;
stopAt          endTime;

endTime         2800;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      5;

writeFormat     ascii;

writePrecision  10;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

functions
{
  //#include "fieldAverage"
}


// ************************************************************************* //
