Wassertank_Rohr_gedreht/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
      solver           GAMG;
      tolerance        1e-6;
      relTol           0.01;
      smoother         GaussSeidel;
      cacheAgglomeration  true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
      maxIter          200;    
    }

    p_rghFinal
    {
        $p_rgh;
	tolerance 1e-6;
        relTol          0;
	maxIter   200; 
    }

    "(U|h|e|k|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        "(U|k|epsilon|omega|nuTilda|T)"
        {
            relTol          0;
            tolerance       0.001;
        }
    }
} 


// ************************************************************************* //
