Wassertank_Rohr_gedreht/system/snappySetupDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappySetupDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setAllPatches false;

volRefine 
(
"VR.*"
);
